taskLister_api/app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    list = List.find(params[:id])

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Fabiano Cunha"], ["created_at", "2017-11-30 02:47:51.170399"], ["updated_at", "2017-11-30 02:47:51.170399"]]
---
  def create
    new_list = List.new(lists_params)
    if (new_list.save)