taskLister_api/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    tasks = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    task = Task.find(params[:id])

INSERT INTO "tasks" ("name", "date", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "New List"], ["date", "2017-11-30"], ["list_id", 12], ["created_at", "2017-11-30 05:07:50.670995"], ["updated_at", "2017-11-30 05:07:50.670995"]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    task = Task.new(task_params)
    if task.save
      list = List.find(task.list_id)